#初期状態
A= [[0,0,0,0,0,0,0,0],
    [0,0,0,0,0,0,0,0],
    [0,0,0,0,0,0,0,0],
    [0,0,0,2,1,0,0,0],
    [0,0,0,1,2,0,0,0],
    [0,0,0,0,0,0,0,0],
    [0,0,0,0,0,0,0,0],
    [0,0,0,0,0,0,0,0]]

board=[]
for a in A:				#Aの中の要素を1つずつ取り出す
	board.append(a)			#boardという空リストにaを追加する
#	print (a)
#	print (board)
#石が置ける可能性のあるところを表示
B=[[3, 3, 3, 3, 3, 3, 3, 3],
   [3, 3, 3, 3, 3, 3, 3, 3],
   [3, 3, 3, 3, 3, 3, 3, 3],
   [3, 3, 3, 3, 3, 3, 3, 3],
   [3, 3, 3, 3, 3, 3, 3, 3],
   [3, 3, 3, 3, 3, 3, 3, 3],
   [3, 3, 3, 3, 3, 3, 3, 3],
   [3, 3, 3, 3, 3, 3, 3, 3]]

#すでに石が置いてあるところを表示(4)
for i in range(8):
	for j in range(8):
		if A[i][j] !=0:
			B[i][j]=4
#for b in B:				#初期値
#	print (b)
stone_ok_cell=[]
for i in range(8):
	for j in range(8):
		if A[i][j]==2 and A[i+1][j]==0:
			B[i+1][j]=5
		if A[i][j]==2 and A[i+1][j-1]==0:
			B[i+1][j-1]=5
		if A[i][j]==2 and A[i][j-1]==0:
			B[i][j-1]=5
		if A[i][j]==2 and A[i-1][j-1]==0:
			B[i-1][j-1]=5
		if A[i][j]==2 and A[i-1][j]==0:
			B[i-1][j]=5
		if A[i][j]==2 and A[i-1][j+1]==0:
			B[i-1][j+1]=5
		if A[i][j]==2 and A[i][j+1]==0:
			B[i][j+1]=5
		if A[i][j]==2 and A[i+1][j+1]==0:
			B[i+1][j+1]=5
for b in B:
	stone_ok_cell.append(b)
	print (b)
